## where to install homebrew-cask applications
cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap"

# fish
brew "fish"
brew "fisher" # Plugin manager
brew "starship" # theme

# fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-ibm-plex"
cask "font-jetbrains-mono"
cask "font-iosevka"

# git
brew "git"
brew "gh"
brew "git-delta"

brew "vim"
brew "magic-wormhole"
brew "gnupg"
brew "htop"

brew "ripgrep"
brew "fzf"
brew "exa"

cask "kitty"
cask "visual-studio-code"
cask "google-chrome"

brew "mas"
mas "Xcode", id: 497799835
mas "1Password 7", id: 1333542190
mas "Slack", id: 803453959
mas "Tailscale", id: 1475387142
mas "WireGuard", id: 1451685025
