## where to install homebrew-cask applications
cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap"

# fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-ibm-plex"
cask "font-jetbrains-mono"
cask "font-iosevka"

# User-friendly command-line shell for UNIX-like operating systems
brew "fish"

# Plugin manager for the Fish shell
brew "fisher"

# Cross-shell prompt for astronauts
brew "starship"

# Distributed revision control system
brew "git"

# GitHub command-line tool
brew "gh"

# Syntax-highlighting pager for git and diff output
brew "git-delta"

# Terminal multiplexer
brew "tmux"

# Vi 'workalike' with many additional features
brew "vim"

# Securely transfers data between computers
brew "magic-wormhole"

# GNU Pretty Good Privacy (PGP) package
brew "gnupg"

# Improved top (interactive process viewer)
brew "htop"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Command-line fuzzy finder written in Go
brew "fzf"

# Modern replacement for 'ls'
brew "exa"

# GPU-based terminal emulator
cask "kitty"

# Open-source code editor
cask "visual-studio-code"

# Web browser
cask "google-chrome"
cask "brave-browser"
cask "tor-browser"
cask "firefox"

# API documentation browser and code snippet manager
cask "dash"

# Raspberry Pi Imager
cask "raspberry-pi-imager"

# vlc
cask "vlc"

# Mac App Store command-line interface
brew "mas"
mas "1Password 7", id: 1333542190
mas "iMovie", id: 408981434
mas "Magnet", id: 441258766
mas "NordVPN", id: 905953485
mas "Numbers", id: 409203825
mas "Outline", id: 1356178125
mas "Slack", id: 803453959
mas "Tailscale", id: 1475387142
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
