cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-ibm-plex"
cask "font-jetbrains-mono"
cask "font-iosevka"

# User-friendly command-line shell for UNIX-like operating systems
brew "fish"

# Plugin manager for the Fish shell
brew "fisher"

# Cross-shell prompt for astronauts
brew "starship"

# Distributed revision control system
brew "git"

# GitHub command-line tool
brew "gh"

# Syntax-highlighting pager for git and diff output
brew "git-delta"

# Terminal multiplexer
brew "tmux"

# Vi 'workalike' with many additional features
brew "vim"

# Securely transfers data between computers
brew "magic-wormhole"

# GNU Pretty Good Privacy (PGP) package
brew "gnupg"

# Pinentry for GPG on Mac
brew "pinentry-mac"

# Improved top (interactive process viewer)
brew "htop"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Command-line fuzzy finder written in Go
brew "fzf"

# Modern replacement for 'ls'
brew "exa"
# brew "syncthing"
brew "neovim", args: ["HEAD"]
brew "volta"
cask "kitty"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "google-chrome"
cask "brave-browser"
cask "tor-browser"
cask "firefox"
cask "mullvad-browser"
cask "finicky"
cask "dash"
cask "raspberry-pi-imager"
cask "vlc"
cask "numi"
cask "vnc-viewer"
cask "plex"
cask "microsoft-teams"
cask "microsoft-outlook"
cask "raycast"
cask "outline-manager"
cask "meetingbar"
cask "hammerspoon"
cask "setapp"
cask "obsidian"
brew "cloudflared"

brew "xonsh"
brew "nnn"
brew "tldr"
cask "nextcloud"
cask "steam"
cask "keybase"
cask "mattermost"
brew "wget"
cask "telegram"
cask "far2l"
